# Говорят, если в 22:31:49 посчитать на Python значение определённого выражения, то спустя год станешь очень хорошим программистом. Давайте проверим это утверждение.
# (-3 + ((8 ** 2) - 12) * (4 ** (3 ** 2))) / (2 * 18)

# 1. Создайте переменную и запишите в неё следующее математическое выражение:
result = (-3 + ((8 ** 2) - 12) * (4 ** (3 ** 2))) / (2 * 18)
print(result)
