# Задача 2. Курс от Skillbox

# Повторим задачу, разобранную в уроке, и дополним её одной строчкой.

# Пользователь хочет купить курс и вводит состояние своего банковского счёта для проверки.
# Курс стоит 75 000 рублей. Если на счету хватает денег (больше или равно), то со счёта списываются 75 000 рублей, и программа выводит сообщение об успешной покупке.
# В конце обязательно выводится сообщение «Хорошего дня!», вне зависимости от результата проверки.
# Пример:

# Сколько денег на счету? 90 000

# Курс успешно приобретён.

# Хорошего дня!

bank = int(input('Сколько денег на счету?: '))
course = 75000
if bank >= course:
  bank -= course
  print('Курс успешно приобретен!')
print('Хорошего дня!')

