# Задача 1. Квадраты чисел
# Напишите программу, которая выводит квадраты чисел от 0 до 10. Для этого используйте цикл for и
#     функцию range.

for num in range(11):
    a = num
    print(a, 'в квадрате', '=', num ** 2)
