# Андрей продолжает писать курсовую работу по физике, и теперь ему нужно находить не только объём планеты, но и её площадь. Для этого он использует две такие формулы:
# Формула для площади сферы:

# square = 4 * pi * radius ** 2

# Формула для объёма шара:

# volume = 4 / 3 * pi * radius ** 3

# Так как в самом курсовом проекте эти формулы пригодятся ещё не раз, Андрей решил поступить рационально и просто написать функцию для каждой формулы.

# Напишите программу, которая на вход получает от пользователя радиус планеты (вещественное число) и вызывает функции sphereArea и sphereVolume. Реализуйте эти функции: первая считает и выводит на экран площадь сферы, вторая — объём шара.

import math

radius = float(input("Введите радиус планеты: "))

def sphere_volume(radius):
  print()
  volume = 4 / 3 * math.pi * radius ** 3
  print("Объем планеты равен:", round(volume, 3), "км3")

def sphere_area(radius):
  print()
  square = 4 * math.pi * radius ** 2
  print("Площадь планеты равна:", round(square, 3), "км2\n")

sphere_volume(radius)
sphere_area(radius)

