# Задача 3. Координатные оси
# Напишите программу, которая рисует координатные оси на поле 20×50. Результат должен получиться таким:
# Что нужно поменять в коде, что в середине был не дефис, а вертикальная палочка?
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
# ------------------------|--------------------------
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#=====================================================
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
# --------------------------------------------------
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
#                         |
cycle = 0
for row in range(20):
  for col in range(50):
    if row == 9:
        print('-', end = '')
        cycle += 1
        if cycle == 24:
            print('|', end= '')
    elif col == 24:
      print('|', end = '')
    else:
      print(' ', end = '')
  print()
