# Задача 1. Врата

# Напишите программу, которая выводит в консоль «врата», состоящие из тире, вертикальных линий и пробелов. Поле состоит из 20 строк и 30 столбцов (но не стесняйтесь пробовать и другие размеры).
# ------------------------------
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |
# |                            |

breadth = int(input('Введите значение ширины: '))
height = int(input('Введите значение высоты: '))

for row in range(height):
  for col in range(breadth):
    if row == 0:
      print('-', end = '')
    elif col == 0:
      print('|', end= '')
    elif col == breadth - 1:
      print('|', end= '')
    else:
      print(' ', end= '')
  print()
  #   if row == 0:
  #     print('-', end = '')
  #   elif row == col:
  #     print('|', ' ' * 26, '|', end= '')
  # print()

