#Задача 1. Python!

#Напишите программу, которая выводит в отдельную строчку каждый символ фразы “Python!”.
text = input('Введите текст ')
for symbol in text:
  print(symbol)
