# Задача 1. Доска

# Используя новые знания с циклами и оператором end, выведете на экран “доску”, которую вы делали в первом модуле

# ----------
# |00000000|
# |00000000|
# |00000000|
# |00000000|
# ----------

print('-' * 10, ('\n|' + ('0' * 8) + '|') * 4, '\n' + '-' * 10)
