print('Задача 6. Сумма факториалов')

# Напишите программу,
# которая запрашивает у пользователя число N
# и находит сумму факториалов 1! + 2! + 3! +... + N!
# n! = 1 * 2 * 3 * 4 * 5 *...* (n - 2)(n - 1)n
# 5! = 1 * 2 * 3 * 4 * 5 = 4! * 5 = 120
# 7! = 1 * 2 * 3 * 4 * 5 * 6 * 7 = 6! * 7 = 5040
# 2! = 1 * 2 = 1! * 2 = 2
# 3! = 1 * 2 * 3 = 2! * 3 = 6
# 4! = 1 * 2 * 3 * 4 = 3! * 4 = 24

product = 1
summ = 0
n = int(input('Введите число: '))
for i in range(1, n + 1):
  for j in range(1, i + 1):
    product *= j
  summ += product
  product = 1
print(f'Сумма факториалов равна {summ}')

